const typeChart = {
  一般: {
    weak: ['格鬥'],
    resist: [],
    strong: [],
  },
  火: {
    weak: ['水', '地面', '岩石'],
    resist: ['火', '草', '冰', '蟲', '鋼', '妖精'],
    strong: ['草', '冰', '蟲', '鋼'],
  },
  水: {
    weak: ['電', '草'],
    resist: ['火', '水', '冰', '鋼'],
    strong: ['火', '地面', '岩石'],
  },
  草: {
    weak: ['火', '冰', '毒', '飛行', '蟲'],
    resist: ['水', '草', '地面', '電'],
    strong: ['水', '地面', '岩石'],
  },
  電: {
    weak: ['地面'],
    resist: ['電', '飛行', '鋼'],
    strong: ['水', '飛行'],
  },
  冰: {
    weak: ['火', '格鬥', '岩石', '鋼'],
    resist: ['冰'],
    strong: ['草', '地面', '飛行', '龍'],
  },
  格鬥: {
    weak: ['飛行', '超能力', '妖精'],
    resist: ['蟲', '岩石', '惡'],
    strong: ['一般', '冰', '岩石', '惡', '鋼'],
  },
  毒: {
    weak: ['地面', '超能力'],
    resist: ['草', '格鬥', '毒', '蟲', '妖精'],
    strong: ['草', '妖精'],
  },
  地面: {
    weak: ['水', '草', '冰'],
    resist: ['毒', '岩石'],
    strong: ['火', '電', '毒', '岩石', '鋼'],
  },
  飛行: {
    weak: ['電', '冰', '岩石'],
    resist: ['草', '格鬥', '蟲'],
    strong: ['草', '格鬥', '蟲'],
  },
  超能力: {
    weak: ['蟲', '幽靈', '惡'],
    resist: ['格鬥', '超能力'],
    strong: ['格鬥', '毒'],
  },
  蟲: {
    weak: ['火', '飛行', '岩石'],
    resist: ['草', '格鬥', '地面'],
    strong: ['草', '超能力', '惡'],
  },
  岩石: {
    weak: ['水', '草', '格鬥', '地面', '鋼'],
    resist: ['一般', '火', '毒', '飛行'],
    strong: ['火', '冰', '飛行', '蟲'],
  },
  幽靈: {
    weak: ['幽靈', '惡'],
    resist: ['毒', '蟲'],
    strong: ['幽靈', '超能力'],
  },
  龍: {
    weak: ['冰', '龍', '妖精'],
    resist: ['火', '水', '草', '電'],
    strong: ['龍'],
  },
  惡: {
    weak: ['格鬥', '蟲', '妖精'],
    resist: ['幽靈', '惡'],
    strong: ['超能力', '幽靈'],
  },
  鋼: {
    weak: ['火', '格鬥', '地面'],
    resist: ['一般', '草', '冰', '飛行', '超能力', '蟲', '岩石', '龍', '鋼', '妖精'],
    strong: ['冰', '岩石', '妖精'],
  },
  妖精: {
    weak: ['毒', '鋼'],
    resist: ['格鬥', '蟲', '惡'],
    strong: ['格鬥', '龍', '惡'],
  },
};
